app/Controllers/Admin/Bairros.php

    public function index(){

        $data = [
            'titulo' => 'Listando os bairros atendidos',
            'bairros' => $this->bairroModel->withDeleted(true)->orderBy('nome','ASC')->paginate(10),
---
SELECT *
FROM `bairros`
ORDER BY `nome` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `bairros`

    private function buscaBairroOu404(int $id = null){

        if(!$id || !$bairro = $this->bairroModel->withDeleted(true)->where('id', $id)->first()){
---
SELECT *
FROM `bairros`
WHERE `id` = 1
GROUP BY `bairros`.`id`
ORDER BY `bairros`.`id` ASC
 LIMIT 1