app/Controllers/Admin/Expedientes.php

    public function expedientes(){

        $data = [
            'titulo' => 'Gerenciar o horário de funcionamento',
            'expedientes' => $this->expedienteModel->findAll(),
---
SELECT *
FROM `expediente`