app/Controllers/Admin/Medidas.php

    public function index(){
        $data = [
            'titulo' => 'Listando as medidas de produtos',
            'medidas' => $this->medidaModel->withDeleted(true)->paginate(10),
            'pager' => $this->medidaModel->pager,
        ];
---
SELECT *
FROM `medidas`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `medidas`

    private function buscaMedidaOu404(int $id = null){

        if(!$id || !$medida = $this->medidaModel->withDeleted(true)->where('id', $id)->first()){
---
SELECT *
FROM `medidas`
WHERE `id` = 2
GROUP BY `medidas`.`id`
ORDER BY `medidas`.`id` ASC
 LIMIT 1

    public function excluir($id = null){

        $medida = $this->buscaMedidaOu404($id);


        if($medida->deletado_em != null){
            return redirect()->back()->with('info', "A medida $medida->nome já encontra-se excluido.");
        }


        if($this->request->getMethod() === 'post'){

            $this->medidaModel->delete($id);
---
UPDATE `medidas` SET `deletado_em` = '2022-09-04 08:56:21', `atualizado_em` = '2022-09-04 08:56:21'
WHERE `id` IN ('2')
AND `deletado_em` IS NULL