app/Controllers/Admin/Produtos.php

    public function index(){
        $data = [
            'titulo' => 'Listando as produtos',
            'produtos' => $this->produtoModel
                ->select('produtos.*, categorias.nome AS categoria')
                ->join('categorias','categorias.id = produtos.categoria_id')
                ->withDeleted(true)
                ->paginate(10),
---
SELECT COUNT(*) AS `numrows`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
SELECT `produtos`.*, `categorias`.`nome` AS `categoria`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
 LIMIT 10

    private function buscaProdutoOu404(int $id = null){

        if(!$id || !$produto = $this->produtoModel->select('produtos.*, categorias.nome AS categoria')
            ->join('categorias','categorias.id = produtos.categoria_id')
            ->where('produtos.id', $id)
            ->withDeleted(true)
            ->first()){
---
SELECT `produtos`.*, `categorias`.`nome` AS `categoria`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
WHERE `produtos`.`id` = 1
GROUP BY `produtos`.`id`
ORDER BY `produtos`.`id` ASC
 LIMIT 1

    public function atualizar($id = null){
        if($this->request->getMethod() === 'post'){

            $produto = $this->buscaProdutoOu404($id);

            //dd($this->request->getPost());
            $produto->fill($this->request->getPost());

            if(!$produto->hasChanged()){
                return redirect()->back()->with('info', 'Não ha dados para atualizar');
            }

            if($this->produtoModel->save($produto)){
---
UPDATE `produtos` SET `ingredientes` = 'Lata de coca cola', `atualizado_em` = '2022-09-20 17:37:36'
WHERE `produtos`.`id` IN ('3')