app/Models/ProdutoEspecificacaoModel.php

    public function buscaEspecificacoesDoProduto(int $produto_id, int $quantidade_paginacao){

        return $this->select('medidas.nome AS medida, produtos_especificacoes.*')
                    ->join('medidas', 'medidas.id = produtos_especificacoes.medida_id ' )
                    ->join('produtos', 'produtos.id = produtos_especificacoes.produto_id ')
                    ->where('produtos_especificacoes.produto_id', $produto_id)
                    ->paginate($quantidade_paginacao);
---
SELECT COUNT(*) AS `numrows`
FROM `produtos_especificacoes`
JOIN `medidas` ON `medidas`.`id` = `produtos_especificacoes`.`medida_id`
JOIN `produtos` ON `produtos`.`id` = `produtos_especificacoes`.`produto_id`
WHERE `produtos_especificacoes`.`produto_id` = 1
SELECT `medidas`.`nome` AS `medida`, `produtos_especificacoes`.*
FROM `produtos_especificacoes`
JOIN `medidas` ON `medidas`.`id` = `produtos_especificacoes`.`medida_id`
JOIN `produtos` ON `produtos`.`id` = `produtos_especificacoes`.`produto_id`
WHERE `produtos_especificacoes`.`produto_id` = 1
 LIMIT 10

    public function buscaEspecificacoesDoProdutoDetalhes(int $produto_id){

        return $this->select('medidas.nome, produtos_especificacoes.id AS especificacao_id, produtos_especificacoes.preco, produtos_especificacoes.customizavel')
        ->join('medidas', 'medidas.id = produtos_especificacoes.medida_id ' )
        ->join('produtos', 'produtos.id = produtos_especificacoes.produto_id ')
        ->where('produtos_especificacoes.produto_id', $produto_id)
        ->findAll();
---
SELECT `medidas`.`nome`, `produtos_especificacoes`.`id` AS `especificacao_id`, `produtos_especificacoes`.`preco`
FROM `produtos_especificacoes`
JOIN `medidas` ON `medidas`.`id` = `produtos_especificacoes`.`medida_id`
JOIN `produtos` ON `produtos`.`id` = `produtos_especificacoes`.`produto_id`
WHERE `produtos_especificacoes`.`produto_id` = 2